{
  "personalInfo": {
    "name": "Jacob Benjamin",
    "title": "Technical Program Manager & Low-Code Expert",
    "location": "Marshall, VA",
    "phone": "(540) 270-3664",
    "email": "jacobbrianbenjamin@gmail.com",
    "summary": "Technical Program Manager & Low-Code Expert holding PMP, Appian Certified Lead Developer, and Security+. Combines strategic leadership of a $70M+ program with hands-on expertise in Appian, Salesforce, OneStream, Docusign, and Agile methodologies. Specialized in leading digital transformation efforts that modernized legacy DoD systems, resulting in an annual $142K labor cost reduction, a $600K+ profit increase, and significant NPS improvements.",
    "expertise": [
      "Technical Program Management",
      "Agile SDLC",
      "Digital Modernization",
      "Enterprise Low-Code Strategy",
      "Solution Architecture",
      "Strategic Roadmap Planning",
      "Process Reengineering",
      "Risk & Conflict Management",
      "Organizational Change Management",
      "Requirements Engineering"
    ]
  },
  "experience": [
    {
      "id": 1,
      "company": "MANTECH",
      "role": "Program Manager",
      "period": "Jan 2025 - Present",
      "type": "Arlington, VA",
      "project": "Army – Resource Manager's Workspace (RMW) & Installation Resource Integration Tool (IRIT)",
      "details": [
        "Leads a team of 20+ across requirements, development, testing, training, and organizational change management (OCM) workstreams in successfully executing the $70M Army RMW and Army G9 IRIT OneStream projects by continuously driving process improvements and transparency.",
        "Guides government stakeholders in the strategic deployment of a OneStream Planning, Programming, Budgeting, Execution (PPBE) system to the Army Budget Office (ABO), all 26 commands, and 10,000+ users.",
        "Proactively works with Army stakeholders, including the Business Transformation Team, to identify further opportunities and requirements that can leverage the OneStream RMW platform, enabling the future divestiture of several legacy systems.",
        "Coaches the Agile team in delivery best practices and processes, including Scrum, requirements elicitation, analysis/ design, and testing methodologies/ planning.",
        "Rescued a failing project following a failed Initial Operating Capabilities (IOC) go-live. Overhauled delivery processes and established transparent client communication, resulting in a Net Promoter Score (NPS) increase from Detractor to Promoter.",
        "Navigated federally mandated budget reductions, resulting in minimized impact to project milestones and personnel, and increased profitability by $600K+."
      ]
    },
    {
      "id": 2,
      "company": "MANTECH",
      "role": "Deputy Project Manager",
      "period": "Jan 2024 - Jan 2025",
      "type": "Washington, D.C.",
      "project": "National Defense University - NDU Connect & Academic Business Support",
      "details": [
        "Served as the Deputy Project Manager, Scrum Master, Business Analyst, and Docusign Developer on the NDU Connect and Academic Business Support (ABS) projects, and steered project progress by coaching the Scrum team and customer in delivery process best practices and standards.",
        "Configured Salesforce and Docusign functionality, including the account creation process and DD 2875 Form, resulting in a savings of 1,450 hours annually, a ~$142,100 labor cost reduction, and an estimated 11% decrease in data entry errors via full digitalization.",
        "Contributed significant portions to presentation on “Educating Tomorrow’s Defense Leaders by Enabling AI-readiness through DoD University Data Standardization” based on the NDU Connect implementation at the 2024 Army University Learning Symposium.",
        "Collaborated with stakeholders to identify realistic project goals, and communicate progress, risks, and ROIs to management via Power BI dashboards, weekly/ monthly status reports, and status meetings.",
        "Managed Agile documentation efforts via Azure DevOps Boards, Teams, and SharePoint, including the creation of user stories and other deliverables."
      ]
    },
    {
      "id": 3,
      "company": "MANTECH (formerly Definitive Logic)",
      "role": "Lead Software Engineer",
      "period": "Oct 2022 - Dec 2023",
      "type": "Arlington, VA",
      "project": "Air Force Office of Special Investigations - OSI Records, Investigations & Operations Network (ORION)",
      "details": [
        "Utilized prior experience to inform technical design decisions regarding enforcement case management systems in Appian.",
        "Performed analysis to identify under-performant processes and implemented best practices to reduce system load times by ~30% for high-volume operations, significantly improving the user experience.",
        "Improved usability and maintainability across system by enforcing improved documentation standards and encouraging collaboration with stakeholders.",
        "Redesigned all user interfaces to better align with Section 508 and WCAG 2.0 standards."
      ]
    },
    {
      "id": 4,
      "company": "Nuvitek",
      "role": "Appian Developer",
      "period": "Aug 2022 - Oct 2022",
      "type": "Arlington, VA",
      "project": "Department of Labor - Trade Adjustment Assistance",
      "details": [
        "Performed O&M for the DOL Trade Adjustment Assistance application by migrating historical data and increasing system performance in Appian.",
        "Reviewed system against requirements to identify requirement gaps and usability and performance issues.",
        "Facilitated backlog grooming sessions and coached the customer on prioritizing new capabilities against maintenance work.",
        "Quickly addressed production defects and corrected in-flight processes."
      ]
    },
    {
      "id": 5,
      "company": "Nuvitek",
      "role": "Appian Developer",
      "period": "Aug 2021 - Aug 2022",
      "type": "Arlington, VA",
      "project": "National Oceanic and Atmospheric Administration - Enforcement Case Management System",
      "details": [
        "Built a joint enforcement case management system in Appian for NOAA’s Office of Law Enforcement and General Counsel Section.",
        "Led UI/UX endeavors, including the creation of a UX Design and Style guide.",
        "Designed foundational functionalities, including user management and task management.",
        "Developed and implemented an efficient process to produce 60+ dynamically generated PDF and Microsoft Word documents via XML templates.",
        "Implemented Record Type functionalities to optimize speed and efficiency."
      ]
    },
    {
      "id": 6,
      "company": "REI Systems",
      "role": "Technology Consultant",
      "period": "Aug 2020 - Aug 2021",
      "type": "Remote",
      "project": "Office of the Comptroller of the Currency - Central Application Tracking",
      "details": [
        "Led teams of 3+ in developing and designing viable Appian solutions for design challenges and contract proposal demos in under one month.",
        "Developed enterprise framework applications for rapid implementation of common application features.",
        "Implemented numerous integrations, including Google Cloud Document AI, Google Cloud Vision API, Google Cloud Natural Language API, Google Maps API, Google Chart API, SharePoint, and Salesforce.",
        "Trained junior staff in software engineering best practices, standards, and consulting approaches.",
        "Served as a database developer on 3 concurrent projects."
      ]
    },
    {
      "id": 7,
      "company": "Groundswell (formerly Collabralink)",
      "role": "Consultant - Appian Consultant",
      "period": "Jul 2019 - Aug 2020",
      "type": "Tysons Corner, VA",
      "project": "Centers for Medicare & Medicaid Services - Acquisition Lifecycle Modernization",
      "details": [
        "Designed and implemented BPM-based solutions using Appian low-code software.",
        "Performed analysis, design, and development of BPM-based applications in an Agile environment.",
        "Translated business process system requirement specifications into process model prototypes and solutions.",
        "Researched key systems and wrote business proposals to enhance internal enterprise frameworks.",
        "Coordinated closely with other developers to verify proper implementation of program and system specifications.",
        "Presented UX designs and solutions to senior staff, promoting user-centric design decisions."
      ]
    }
  ],
  "education": [
    {
      "school": "MIT xPRO",
      "degree": "Driving Innovation with Generative AI",
      "date": "Nov 2025"
    },
    {
      "school": "University of Maryland Global Campus",
      "degree": "M.S. IT: Systems Engineering",
      "date": "Aug 2022"
    },
    {
      "school": "Virginia Polytechnical Institute and State University",
      "degree": "B.S. Psychology",
      "date": "Jul 2019"
    }
  ],
  "volunteer": {
    "org": "FIRST Chesapeake & FIRST Robotics Team 1731",
    "role": "Volunteer Coordinator & Mentor",
    "period": "Nov 2022 - Mar 2025",
    "details": [
      "Lead presenter at the FIRST Chesapeake GEARED UP: Mentors Conference 2024 on adapting and implementing Agile Scrum methodologies for student-led teams.",
      "Assisted full-time staff with recruiting volunteers and assigning volunteer roles for three-day competitions in Virginia, Maryland, and Washington D.C.",
      "Facilitated age-appropriate education on cybersecurity for elementary, middle school, and high school age students via card games at competition events.",
      "Mentored team of 15+ high school age students during a six-week build period in Agile Scrum methodologies, systems engineering and design principles, software development best practices, and “real-world” team processes.",
      "Supported team in achieving several accomplishments, including: 2023 and 2024 Chesapeake District Championship winner, the Innovation in Control Award, the Excellence in Engineering Award, and 4 Autonomous Awards."
    ]
  },
  "affiliations": [
    "Eagle Scout, Boy Scouts of America",
    "Member, Alpha Phi Omega (National Service Fraternity)",
    "Member, Phi Theta Kappa Honor Society"
  ],
  "certifications": [
    {
      "name": "Project Management Professional (PMP)",
      "logo": "pmp.png",
      "category": "Management & Methodology"
    },
    {
      "name": "Appian Certified Lead Developer",
      "logo": "appian.png",
      "category": "Platforms & Development"
    },
    {
      "name": "CompTIA Security+",
      "logo": "securityplus.png",
      "category": "Security & Infrastructure"
    },
    { 
      "name": "Lean Six Sigma Black Belt", 
      "logo": "lssbb.png",
      "category": "Management & Methodology" 
    },
    { 
      "name": "Certified Scrum Master (CSM)", 
      "logo": "csm.png",
      "category": "Management & Methodology" 
    },
    {
      "name": "Professional Scrum Master (PSM)",
      "logo": "psm.png",
      "category": "Management & Methodology"
    },
    {
      "name": "Salesforce Certified Administrator",
      "logo": "salesforce.png",
      "category": "Platforms & Development"
    },
    {
      "name": "Docusign Sales Executive",
      "logo": "docusign.png",
      "category": "Functional & Consulting"
    },
    {
      "name": "Docusign IAM for Customer Experience - Sales Executive",
      "logo": "docusign-cx.png",
      "category": "Functional & Consulting"
    },
    {
      "name": "Microsoft Azure Fundamentals",
      "logo": "azure.png",
      "category": "Security & Infrastructure"
    },
    {
      "name": "FinOps Certified Practitioner",
      "logo": "finops.png",
      "category": "Functional & Consulting"
    },
    {
      "name": "Certified Web Application Security Professional (CWASP)",
      "logo": "cwasp.png",
      "category": "Security & Infrastructure"
    },
    {
      "name": "Splunk Core Certified Power User (expired 2022)",
      "logo": "splunk.png",
      "category": "Platforms & Development"
    },
    {
      "name": "UiPath Certified Advanced RPA Developer (expired 2021)",
      "logo": "uipath.png",
      "category": "Platforms & Development"
    }
  ],
  "keyMetrics": [
    {
      "label": "Program Value",
      "value": "$70M",
      "icon": "Briefcase",
      "color": "text-blue-500"
    },
    {
      "label": "On Contract Growth",
      "value": "$3M",
      "icon": "TrendingUp",
      "color": "text-blue-500"
    },
    {
      "label": "Increased Profitability",
      "value": "$600K+",
      "icon": "DollarSign",
      "color": "text-blue-500"
    },
    {
      "label": "Eliminated Waste",
      "value": "$200K+",
      "icon": "Zap",
      "color": "text-blue-500"
    }
  ],
  "skillCategories": {
    "Platforms & Apps": [
      "Appian",
      "Salesforce",
      "OneStream",
      "Microsoft Power BI",
      "Docusign"
    ],
    "Databases": [
      "MySQL",
      "MariaDB",
      "Oracle Database",
      "Microsoft SQL Server"
    ],
    "Management Tools": [
      "Jira",
      "Azure DevOps",
      "Asana",
      "IBM Jazz",
      "MS Project",
      "Visio"
    ]
  },
  "testimonials": [
    {
      "source": "Army RMW PM",
      "text": "Since Jacob has come on board, he's definitely improved team collaboration. Again, I've got to give credit to Jacob coming in and trying to align the team better and we've definitely see a lot of improvement over the last year."
    },
    {
      "source": "Army RMW COR",
      "text": "I wanted to say that as the COR, I do appreciate Jacob and his efforts. They've helped a lot. They've helped us alot of times during these calls (Integrated Program Reviews). We'll work out something related to onboarding, or the contract, or even payments/ We'll do it during this call, but if it's not resolved, then he'll follow up. I appreciate it because I do have other contracts, and I try to be time sensitive when we're doing onboarding or anything like that, but he does make sure that he typically keeps me in line. So, I appreciate his assistance."
    },
    {
      "source": "Army RMW PM",
      "text": "Your background in software development knowledge has been critical in understanding where risk areas are and what level of effort is required to complete a piece of capability. From my perspective, you are effective in getting the work complete by collaborating with the development team."
    }
  ]
}
